from turtle import *  # импортируем все функции модуля turtle

lt(90)  # поворот налево на 90 градусов (направляем черепаху вертикально вверх)
tracer(0)  # отключает отрисовку черепахой
screensize(5000, 5000)

r = 35  # шаг в пикселях на 1 единицу движения черепахи
rt(30)
for _ in range(3):
    rt(150)
    fd(6 * r)
    rt(30)
    fd(12 * r)

up()  # поднимаем хвост вверх
# Отрисовка целочисленных точек
for x in range(-50, 50):
    for y in range(-50, 50):
        goto(x * r, y * r)
        dot(5, 'red')
update()  # для Pycharm
done()  # для Pycharm
